tap "homebrew/bundle"
tap "unisonweb/unison"
tap "xo/xo"
brew "brotli"
brew "autoconf"
brew "autojump"
brew "bash"
brew "boost"
brew "broot"
brew "c-ares"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "docker-ls"
brew "double-conversion"
brew "edencommon"
brew "elan-init"
brew "libgit2"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghcup"
brew "git"
brew "git-delta"
brew "gpatch"
brew "grex"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jq"
brew "just"
brew "kakoune"
brew "lazygit"
brew "libgit2@1.6"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "llm"
brew "lpeg"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "luv"
brew "msgpack"
brew "neofetch"
brew "neovide"
brew "nmap"
brew "node"
brew "nvm"
brew "opam"
brew "openssl@1.1"
brew "pandoc"
brew "pipx"
brew "pkg-config"
brew "poppler"
brew "prettierd"
brew "python@3.10"
brew "python@3.11"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "sapling"
brew "sevenzip"
brew "shellcheck"
brew "sql-language-server"
brew "starship"
brew "stylua"
brew "taplo"
brew "tealdeer"
brew "tmux"
brew "trunk"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "watchexec"
brew "watchman"
brew "yaml-language-server"
brew "yarn"
brew "yazi"
brew "zola"
brew "zoxide"
brew "unisonweb/unison/unison-language"
cask "1password-cli"
cask "alacritty"
cask "dbeaver-community"
cask "docker"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
cask "kitty"
cask "microsoft-openjdk"
cask "mks"
cask "netnewswire"
cask "postman"
cask "rectangle-pro"
cask "visual-studio-code"
cask "zulu@11"
cask "zulu@17"
vscode "42crunch.vscode-openapi"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.bookmarks"
vscode "andys8.jest-snippets"
vscode "antfu.browse-lite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "atlassian.atlascode"
vscode "bbenoist.nix"
vscode "benfradet.vscode-unison"
vscode "bierner.markdown-mermaid"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golf1052.base16-generator"
vscode "gregoire.dance"
vscode "haskell.haskell"
vscode "jasew.vscode-helix-emulation"
vscode "jdinhlife.gruvbox"
vscode "jebbs.plantuml"
vscode "jnoortheen.nix-ide"
vscode "johnpapa.vscode-peacock"
vscode "justusadam.language-haskell"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leanprover.lean4"
vscode "linhmtran168.mac-ca-vscode"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "msjsdiag.vscode-react-native"
vscode "newdatasystems.foxpro"
vscode "pflannery.vscode-versionlens"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "silverquark.dancehelix"
vscode "skellock.just"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "unional.vscode-sort-package-json"
vscode "unison-lang.unison"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visortelle.haskell-spotlight"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
